# GetCurrent Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FluidTemperatureSetIterator..::..GetCurrent Method
FluidTemperatureSetIterator Class See Also
---
Returns the current FluidTemperature.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public FluidTemperature GetCurrent()
```

Visual Basic
---
```text
Public Function GetCurrent As FluidTemperature
```

Visual C++
---
```text
public:
FluidTemperature^ GetCurrent()
```

# ### Return Value
The current FluidTemperature.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
FluidTemperatureSetIterator Class
Autodesk.Revit.DB.Plumbing Namespace